OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f65k90.h
extern __at(0x0F61) __sfr EEDATA;
extern __at(0x0F62) __sfr EEADR;
extern __at(0x0F63) __sfr EEADRH;

//==============================================================================
//        OSCCON2 Bits

extern __at(0x0F64) __sfr OSCCON2;

typedef struct
  {
  unsigned MFIOSEL              : 1;
  unsigned MFIOFS               : 1;
  unsigned                      : 1;
  unsigned SOSCGO               : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned SOSCRUN              : 1;
  unsigned                      : 1;
  } __OSCCON2bits_t;

extern __at(0x0F64) volatile __OSCCON2bits_t OSCCON2bits;

#define _MFIOSEL                0x01
#define _MFIOFS                 0x02
#define _SOSCGO                 0x08
#define _SOSCRUN                0x40

//==============================================================================


//==============================================================================
//        BAUDCON Bits

extern __at(0x0F65) __sfr BAUDCON;

typedef struct
  {
  unsigned ABDEN                : 1;
  unsigned WUE                  : 1;
  unsigned                      : 1;
  unsigned BRG16                : 1;
  unsigned TXCKP                : 1;
  unsigned RXDTP                : 1;
  unsigned RCIDL                : 1;
  unsigned ABDOVF               : 1;
  } __BAUDCONbits_t;

extern __at(0x0F65) volatile __BAUDCONbits_t BAUDCONbits;

#define _ABDEN                  0x01
#define _WUE                    0x02
#define _BRG16                  0x08
#define _TXCKP                  0x10
#define _RXDTP                  0x20
#define _RCIDL                  0x40
#define _ABDOVF                 0x80

//==============================================================================


//==============================================================================
//        BAUDCON1 Bits

extern __at(0x0F65) __sfr BAUDCON1;

typedef struct
  {
  unsigned ABDEN                : 1;
  unsigned WUE                  : 1;
  unsigned                      : 1;
  unsigned BRG16                : 1;
  unsigned TXCKP                : 1;
  unsigned RXDTP                : 1;
  unsigned RCIDL                : 1;
  unsigned ABDOVF               : 1;
  } __BAUDCON1bits_t;

extern __at(0x0F65) volatile __BAUDCON1bits_t BAUDCON1bits;

#define _BAUDCON1_ABDEN         0x01
#define _BAUDCON1_WUE           0x02
#define _BAUDCON1_BRG16         0x08
#define _BAUDCON1_TXCKP         0x10
#define _BAUDCON1_RXDTP         0x20
#define _BAUDCON1_RCIDL         0x40
#define _BAUDCON1_ABDOVF        0x80

//==============================================================================


//==============================================================================
//        BAUDCTL Bits

extern __at(0x0F65) __sfr BAUDCTL;

typedef struct
  {
  unsigned ABDEN                : 1;
  unsigned WUE                  : 1;
  unsigned                      : 1;
  unsigned BRG16                : 1;
  unsigned TXCKP                : 1;
  unsigned RXDTP                : 1;
  unsigned RCIDL                : 1;
  unsigned ABDOVF               : 1;
  } __BAUDCTLbits_t;

extern __at(0x0F65) volatile __BAUDCTLbits_t BAUDCTLbits;

#define _BAUDCTL_ABDEN          0x01
#define _BAUDCTL_WUE            0x02
#define _BAUDCTL_BRG16          0x08
#define _BAUDCTL_TXCKP          0x10
#define _BAUDCTL_RXDTP          0x20
#define _BAUDCTL_RCIDL          0x40
#define _BAUDCTL_ABDOVF         0x80

//==============================================================================


//==============================================================================
//        LCDDATA0 Bits

extern __at(0x0F66) __sfr LCDDATA0;

typedef struct
  {
  unsigned S00C0                : 1;
  unsigned S01C0                : 1;
  unsigned S02C0                : 1;
  unsigned S03C0                : 1;
  unsigned S04C0                : 1;
  unsigned S05C0                : 1;
  unsigned S06C0                : 1;
  unsigned S07C0                : 1;
  } __LCDDATA0bits_t;

extern __at(0x0F66) volatile __LCDDATA0bits_t LCDDATA0bits;

#define _S00C0                  0x01
#define _S01C0                  0x02
#define _S02C0                  0x04
#define _S03C0                  0x08
#define _S04C0                  0x10
#define _S05C0                  0x20
#define _S06C0                  0x40
#define _S07C0                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA1 Bits

extern __at(0x0F67) __sfr LCDDATA1;

typedef struct
  {
  unsigned S08C0                : 1;
  unsigned S09C0                : 1;
  unsigned S10C0                : 1;
  unsigned S11C0                : 1;
  unsigned S12C0                : 1;
  unsigned S13C0                : 1;
  unsigned S14C0                : 1;
  unsigned S15C0                : 1;
  } __LCDDATA1bits_t;

extern __at(0x0F67) volatile __LCDDATA1bits_t LCDDATA1bits;

#define _S08C0                  0x01
#define _S09C0                  0x02
#define _S10C0                  0x04
#define _S11C0                  0x08
#define _S12C0                  0x10
#define _S13C0                  0x20
#define _S14C0                  0x40
#define _S15C0                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA2 Bits

extern __at(0x0F68) __sfr LCDDATA2;

typedef struct
  {
  unsigned S16C0                : 1;
  unsigned S17C0                : 1;
  unsigned S18C0                : 1;
  unsigned S19C0                : 1;
  unsigned S20C0                : 1;
  unsigned S21C0                : 1;
  unsigned S22C0                : 1;
  unsigned S23C0                : 1;
  } __LCDDATA2bits_t;

extern __at(0x0F68) volatile __LCDDATA2bits_t LCDDATA2bits;

#define _S16C0                  0x01
#define _S17C0                  0x02
#define _S18C0                  0x04
#define _S19C0                  0x08
#define _S20C0                  0x10
#define _S21C0                  0x20
#define _S22C0                  0x40
#define _S23C0                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA3 Bits

extern __at(0x0F69) __sfr LCDDATA3;

typedef struct
  {
  unsigned S24C0                : 1;
  unsigned S25C0                : 1;
  unsigned S26C0                : 1;
  unsigned S27C0                : 1;
  unsigned S28C0                : 1;
  unsigned S29C0                : 1;
  unsigned S30C0                : 1;
  unsigned S31C0                : 1;
  } __LCDDATA3bits_t;

extern __at(0x0F69) volatile __LCDDATA3bits_t LCDDATA3bits;

#define _S24C0                  0x01
#define _S25C0                  0x02
#define _S26C0                  0x04
#define _S27C0                  0x08
#define _S28C0                  0x10
#define _S29C0                  0x20
#define _S30C0                  0x40
#define _S31C0                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA4 Bits

