OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f65k90.h
#define _RB0                    0x01
#define _INT0                   0x01
#define _SEG30                  0x01
#define _FLT0                   0x01
#define _RB1                    0x02
#define _INT1                   0x02
#define _SEG8                   0x02
#define _RB2                    0x04
#define _INT2                   0x04
#define _SEG9                   0x04
#define _CTED1                  0x04
#define _RB3                    0x08
#define _INT3                   0x08
#define _SEG10                  0x08
#define _CTED2                  0x08
#define _CCP2_PA2               0x08
#define _RB4                    0x10
#define _KBI0                   0x10
#define _SEG11                  0x10
#define _RB5                    0x20
#define _KBI1                   0x20
#define _SEG29                  0x20
#define _T3CKI                  0x20
#define _T1G                    0x20
#define _PGM                    0x20
#define _RB6                    0x40
#define _KBI2                   0x40
#define _PGC                    0x40
#define _RB7                    0x80
#define _KBI3                   0x80
#define _PGD                    0x80

//==============================================================================


//==============================================================================
//        PORTC Bits

extern __at(0x0F82) __sfr PORTC;

typedef union
  {
  struct
    {
    unsigned RC0                : 1;
    unsigned RC1                : 1;
    unsigned RC2                : 1;
    unsigned RC3                : 1;
    unsigned RC4                : 1;
    unsigned RC5                : 1;
    unsigned RC6                : 1;
    unsigned RC7                : 1;
    };

  struct
    {
    unsigned SOSCO              : 1;
    unsigned SEG32              : 1;
    unsigned SEG13              : 1;
    unsigned SEG17              : 1;
    unsigned SEG16              : 1;
    unsigned SEG12              : 1;
    unsigned SEG27              : 1;
    unsigned SEG28              : 1;
    };

  struct
    {
    unsigned SCKLI              : 1;
    unsigned SOSCI              : 1;
    unsigned CCP1               : 1;
    unsigned SCK1               : 1;
    unsigned SDI1               : 1;
    unsigned SDO1               : 1;
    unsigned TX1                : 1;
    unsigned RX1                : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned CCP2               : 1;
    unsigned PA1                : 1;
    unsigned SCL1               : 1;
    unsigned SDA1               : 1;
    unsigned                    : 1;
    unsigned CK1                : 1;
    unsigned DT1                : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned PA2                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PORTCbits_t;

extern __at(0x0F82) volatile __PORTCbits_t PORTCbits;

#define _RC0                    0x01
#define _SOSCO                  0x01
#define _SCKLI                  0x01
#define _RC1                    0x02
#define _SEG32                  0x02
#define _SOSCI                  0x02
#define _CCP2                   0x02
#define _PA2                    0x02
#define _RC2                    0x04
#define _SEG13                  0x04
#define _CCP1                   0x04
#define _PA1                    0x04
#define _RC3                    0x08
#define _SEG17                  0x08
#define _SCK1                   0x08
#define _SCL1                   0x08
#define _RC4                    0x10
#define _SEG16                  0x10
#define _SDI1                   0x10
#define _SDA1                   0x10
#define _RC5                    0x20
#define _SEG12                  0x20
#define _SDO1                   0x20
#define _RC6                    0x40
#define _SEG27                  0x40
#define _TX1                    0x40
#define _CK1                    0x40
#define _RC7                    0x80
#define _SEG28                  0x80
#define _RX1                    0x80
#define _DT1                    0x80

//==============================================================================


//==============================================================================
//        PORTD Bits

extern __at(0x0F83) __sfr PORTD;

typedef union
  {
  struct
    {
    unsigned RD0                : 1;
    unsigned RD1                : 1;
    unsigned RD2                : 1;
    unsigned RD3                : 1;
    unsigned RD4                : 1;
    unsigned RD5                : 1;
    unsigned RD6                : 1;
    unsigned RD7                : 1;
    };

  struct
    {
    unsigned AD0                : 1;
    unsigned AD1                : 1;
    unsigned AD2                : 1;
    unsigned AD3                : 1;
    unsigned AD4                : 1;
    unsigned AD5                : 1;
    unsigned AD6                : 1;
    unsigned AD7                : 1;
    };

  struct
    {
    unsigned PSP0               : 1;
    unsigned PSP1               : 1;
    unsigned PSP2               : 1;
    unsigned PSP3               : 1;
    unsigned PSP4               : 1;
    unsigned PSP5               : 1;
    unsigned PSP6               : 1;
    unsigned PSP7               : 1;
    };

  struct
    {
    unsigned SEG0               : 1;
    unsigned SEG1               : 1;
    unsigned SEG2               : 1;
    unsigned SEG3               : 1;
    unsigned SEG4               : 1;
    unsigned SEG5               : 1;
    unsigned SEG6               : 1;
    unsigned SEG7               : 1;
    };

  struct
    {
    unsigned CTPLS              : 1;
    unsigned T5CKI              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned SDO2               : 1;
    unsigned SDI2               : 1;
    unsigned SCK2               : 1;
    unsigned SS2                : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned T7G                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned SDA2               : 1;
    unsigned SCL2               : 1;
    unsigned                    : 1;
    };
  } __PORTDbits_t;

extern __at(0x0F83) volatile __PORTDbits_t PORTDbits;

#define _RD0                    0x01
#define _AD0                    0x01
#define _PSP0                   0x01
#define _SEG0                   0x01
#define _CTPLS                  0x01
#define _RD1                    0x02
#define _AD1                    0x02
#define _PSP1                   0x02
#define _SEG1                   0x02
#define _T5CKI                  0x02
#define _T7G                    0x02
#define _RD2                    0x04
#define _AD2                    0x04
#define _PSP2                   0x04
#define _SEG2                   0x04
#define _RD3                    0x08
#define _AD3                    0x08
#define _PSP3                   0x08
#define _SEG3                   0x08
#define _RD4                    0x10
#define _AD4                    0x10
#define _PSP4                   0x10
#define _SEG4                   0x10
#define _SDO2                   0x10
#define _RD5                    0x20
#define _AD5                    0x20
#define _PSP5                   0x20
#define _SEG5                   0x20
#define _SDI2                   0x20
#define _SDA2                   0x20
#define _RD6                    0x40
#define _AD6                    0x40
#define _PSP6                   0x40
#define _SEG6                   0x40
#define _SCK2                   0x40
#define _SCL2                   0x40
#define _RD7                    0x80
#define _AD7                    0x80
#define _PSP7                   0x80
#define _SEG7                   0x80
#define _SS2                    0x80

//==============================================================================


//==============================================================================
//        PORTE Bits

extern __at(0x0F84) __sfr PORTE;

typedef union
  {
  struct
    {
    unsigned RE0                : 1;
    unsigned RE1                : 1;
    unsigned RE2                : 1;
    unsigned RE3                : 1;
    unsigned RE4                : 1;
    unsigned RE5                : 1;
    unsigned RE6                : 1;
    unsigned RE7                : 1;
    };

  struct
    {
    unsigned AD8                : 1;
    unsigned AD9                : 1;
    unsigned AD10               : 1;
    unsigned AD11               : 1;
    unsigned AD12               : 1;
    unsigned AD13               : 1;
    unsigned AD14               : 1;
    unsigned AD15               : 1;
    };

  struct
    {
    unsigned PD2                : 1;
    unsigned PC2                : 1;
    unsigned PB2                : 1;
    unsigned PC3                : 1;
    unsigned PB3                : 1;
    unsigned PC1                : 1;
    unsigned PB1                : 1;
    unsigned PA2                : 1;
    };

  struct
    {
    unsigned RD                 : 1;
    unsigned WR                 : 1;
    unsigned CCP10              : 1;
    unsigned CCP9               : 1;
    unsigned CCP8               : 1;
    unsigned CCP7               : 1;
    unsigned CCP6               : 1;
    unsigned CCP2               : 1;
    };

  struct
    {
    unsigned LCDBIAS1           : 1;
    unsigned LCDBIAS2           : 1;
    unsigned CS                 : 1;
    unsigned COM0               : 1;
    unsigned COM1               : 1;
    unsigned COM2               : 1;
    unsigned COM3               : 1;
    unsigned SEG31              : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned LCDBIAS3           : 1;
    unsigned                    : 1;
    unsigned REFO               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 3;
    unsigned COM                : 4;
    unsigned                    : 1;
    };
  } __PORTEbits_t;

